In [141]:
import numpy as np
import pandas as pd

In [142]:
archivo = pd.read_csv('https://raw.githubusercontent.com/JParrales/mision-tic-2021-ciclo_python/master/G25/Reto%205/notas.csv')
archivo

,ESTUDIANTE,MATEMATICA,LENGUAJE,CIENCIAS,CIUDADANAS,IDIOMAS
0,SUAREZ ROLDAN MONICA YULIETH,27,49,98,8,79
1,PLAZA SANCHEZ ALBERT,47,8,68,54,94
2,AGUIRRE RUBIANO RUBEN DARIO,53,21,38,59,14
3,BUITRAGO CARDOZO DIANA PAOLA,49,34,20,65,11
4,MOTTA CADENA LAURA NATALIA,12,77,89,57,84
5,CABRERA CHAVARRO NATHALIE,14,18,42,86,39
6,LOPEZ PAEZ MIGUEL ANGEL,91,61,34,29,100
7,GUEVARA PINILLA FABIAN DAVID,40,47,25,77,52
8,SANCHEZ PERDOMO RODRIGO JOSE,47,92,68,26,54
9,RODRIGUEZ GONZALEZ NESTOR DAVID,5,27,12,12,54
10,PARRASI YANGUMA JUAN SEBASTIAN,28,78,32,79,66
11,SIERRA TRUJILLO JUAN CARLOS,96,14,64,51,55
12,PASTRANA ARDILA JUAN SEBASTIAN,98,21,89,31,62
13,QUINTERO CARDOZO NESTOR ALEJANDRO,98,15,90,3,60
14,MOTTA DUSSAN PAULA ANDREA,20,20,10,7,5
15,LAMILLA TRUJILLO MARIA DEL MAR,76,71,26,33,49
16,RINCON HERNANDEZ HEIDY TATIANA,32,50,4,56,46
17,VILLALBA QUESADA SONIA,29,36,66,7,17
18,RIOS RODRIGUEZ ANDRES FELIPE,83,46,21,29,52
19,CHARRY MORENO ANDRES FELIPE,8,95,11,5,83
20,MANCHOLA PERDOMO MARIA FERNANDA,3,77,81,92,83
21,CADENA DIAZ DIEGO ALEJANDRO,78,2,51,84,7
22,MONROY ARDILA KELLY VANESA,42,74,80,9,100
23,ARROYAVE QUEZADA JOSE ORLANDO,21,87,6,40,61
24,RAMIREZ BARRETO DIEGO ANDRES,69,57,75,46,9
25,SALAZAR CANO JULY ALEXANDRA,5,33,50,7,74
26,TRUJILLO CUERVO LUIS GONZAGA,9,33,81,30,46
27,JAVELA MASMELA LUIS EVELIO,82,2,59,65,66
28,CUELLAR YUSTRES FREDY,40,88,34,10,36
29,SANTANA CORREA DAVID CAMILO,41,75,10,6,54
30,AVILES HERNANDEZ CRISTIAN ADOLFO,37,58,94,39,31
31,GAHONA RAMIREZ JUAN DAVID,100,4,36,86,67
32,AGRONO CLAROS KATHERINE,73,93,97,35,17
33,RODRIGUEZ VANEGAS JANIER,83,39,4,52,97
34,MOLANO JULI@N,89,4,46,76,36
35,CAMACHO CABRERA JUAN DAVID,56,28,79,52,29
36,GUZMAN ROSERO CARLOS ENRIQUE,78,61,77,54,5
37,FERNANDO CRISTIAN,89,93,71,11,77
38,GARCES ORTIZ JUAN CARLOS,77,42,53,24,36
39,GARCIA QUIMBAYA CINDY YAZMIN,71,43,83,59,35
40,PARRA GASPAR JUAN CAMILO,47,90,48,34,96
41,NARVAEZ TORRES JHONATHAN,29,35,55,84,36
42,RUBIANO FIERRO DIANA MARCELA,83,4,76,97,26
43,CEDENO GUZMAN CRISTIAN JULIAN,81,25,20,100,38
44,MONTES MOSQUERA CAMILO ANDRES,86,60,63,66,87
45,ALDANA GUZMAN CRISTIAN IVAN,74,83,3,8,1
46,QUINTERO CARDOZO DUVAN DARIO,79,8,29,15,32
47,HERNANDEZ LUGO PABLO FRANCISCO,91,88,90,66,79
48,MENDEZ MEDINA EDGAR HERNANDO,80,36,57,100,96
49,CRUZ INFANTE MAYCOL JOSE,88,22,94,16,72
50,JIMENEZ ESCOBAR ANGIE DANIELA,68,41,34,89,29
51,PARRALES TORRES JOSE DAVID,49,62,68,68,5
52,JIMENEZ RODRIGUEZ DEIVY ALEXANDER,1,58,66,33,82
53,RODRIGUEZ TIQUE NESTOR,95,8,65,81,89
54,GARNICA CIFUENTES JUAN FERNANDO,34,58,24,8,11
55,SANDOVAL ORTIZ PAOLY EUGENIA,64,71,12,37,44
56,CORREDOR CAJICA ESTEBAN FERNANDO,9,4,72,64,47

In [143]:
type(archivo)

pandas.core.frame.DataFrame

In [144]:
archivo.columns

Index(['ESTUDIANTE', 'MATEMATICA', 'LENGUAJE', 'CIENCIAS', 'CIUDADANAS',
       'IDIOMAS'],
      dtype='object')

In [145]:
archivo.index

RangeIndex(start=0, stop=57, step=1)

In [146]:
archivo.head(10)

,ESTUDIANTE,MATEMATICA,LENGUAJE,CIENCIAS,CIUDADANAS,IDIOMAS
0,SUAREZ ROLDAN MONICA YULIETH,27,49,98,8,79
1,PLAZA SANCHEZ ALBERT,47,8,68,54,94
2,AGUIRRE RUBIANO RUBEN DARIO,53,21,38,59,14
3,BUITRAGO CARDOZO DIANA PAOLA,49,34,20,65,11
4,MOTTA CADENA LAURA NATALIA,12,77,89,57,84
5,CABRERA CHAVARRO NATHALIE,14,18,42,86,39
6,LOPEZ PAEZ MIGUEL ANGEL,91,61,34,29,100
7,GUEVARA PINILLA FABIAN DAVID,40,47,25,77,52
8,SANCHEZ PERDOMO RODRIGO JOSE,47,92,68,26,54
9,RODRIGUEZ GONZALEZ NESTOR DAVID,5,27,12,12,54

In [147]:
archivo['PUNTAJE'] = archivo['MATEMATICA'] + archivo['LENGUAJE'] + archivo['CIENCIAS'] + archivo['CIUDADANAS'] + archivo['IDIOMAS']
archivo.head()

,ESTUDIANTE,MATEMATICA,LENGUAJE,CIENCIAS,CIUDADANAS,IDIOMAS,PUNTAJE
0,SUAREZ ROLDAN MONICA YULIETH,27,49,98,8,79,261
1,PLAZA SANCHEZ ALBERT,47,8,68,54,94,271
2,AGUIRRE RUBIANO RUBEN DARIO,53,21,38,59,14,185
3,BUITRAGO CARDOZO DIANA PAOLA,49,34,20,65,11,179
4,MOTTA CADENA LAURA NATALIA,12,77,89,57,84,319

In [148]:
by_estudiante = archivo.sort_values('ESTUDIANTE')
by_estudiante

,ESTUDIANTE,MATEMATICA,LENGUAJE,CIENCIAS,CIUDADANAS,IDIOMAS,PUNTAJE
32,AGRONO CLAROS KATHERINE,73,93,97,35,17,315
2,AGUIRRE RUBIANO RUBEN DARIO,53,21,38,59,14,185
45,ALDANA GUZMAN CRISTIAN IVAN,74,83,3,8,1,169
23,ARROYAVE QUEZADA JOSE ORLANDO,21,87,6,40,61,215
30,AVILES HERNANDEZ CRISTIAN ADOLFO,37,58,94,39,31,259
3,BUITRAGO CARDOZO DIANA PAOLA,49,34,20,65,11,179
5,CABRERA CHAVARRO NATHALIE,14,18,42,86,39,199
21,CADENA DIAZ DIEGO ALEJANDRO,78,2,51,84,7,222
35,CAMACHO CABRERA JUAN DAVID,56,28,79,52,29,244
43,CEDENO GUZMAN CRISTIAN JULIAN,81,25,20,100,38,264
19,CHARRY MORENO ANDRES FELIPE,8,95,11,5,83,202
56,CORREDOR CAJICA ESTEBAN FERNANDO,9,4,72,64,47,196
49,CRUZ INFANTE MAYCOL JOSE,88,22,94,16,72,292
28,CUELLAR YUSTRES FREDY,40,88,34,10,36,208
37,FERNANDO CRISTIAN,89,93,71,11,77,341
31,GAHONA RAMIREZ JUAN DAVID,100,4,36,86,67,293
38,GARCES ORTIZ JUAN CARLOS,77,42,53,24,36,232
39,GARCIA QUIMBAYA CINDY YAZMIN,71,43,83,59,35,291
54,GARNICA CIFUENTES JUAN FERNANDO,34,58,24,8,11,135
7,GUEVARA PINILLA FABIAN DAVID,40,47,25,77,52,241
36,GUZMAN ROSERO CARLOS ENRIQUE,78,61,77,54,5,275
47,HERNANDEZ LUGO PABLO FRANCISCO,91,88,90,66,79,414
27,JAVELA MASMELA LUIS EVELIO,82,2,59,65,66,274
50,JIMENEZ ESCOBAR ANGIE DANIELA,68,41,34,89,29,261
52,JIMENEZ RODRIGUEZ DEIVY ALEXANDER,1,58,66,33,82,240
15,LAMILLA TRUJILLO MARIA DEL MAR,76,71,26,33,49,255
6,LOPEZ PAEZ MIGUEL ANGEL,91,61,34,29,100,315
20,MANCHOLA PERDOMO MARIA FERNANDA,3,77,81,92,83,336
48,MENDEZ MEDINA EDGAR HERNANDO,80,36,57,100,96,369
34,MOLANO JULI@N,89,4,46,76,36,251
22,MONROY ARDILA KELLY VANESA,42,74,80,9,100,305
44,MONTES MOSQUERA CAMILO ANDRES,86,60,63,66,87,362
4,MOTTA CADENA LAURA NATALIA,12,77,89,57,84,319
14,MOTTA DUSSAN PAULA ANDREA,20,20,10,7,5,62
41,NARVAEZ TORRES JHONATHAN,29,35,55,84,36,239
40,PARRA GASPAR JUAN CAMILO,47,90,48,34,96,315
51,PARRALES TORRES JOSE DAVID,49,62,68,68,5,252
10,PARRASI YANGUMA JUAN SEBASTIAN,28,78,32,79,66,283
12,PASTRANA ARDILA JUAN SEBASTIAN,98,21,89,31,62,301
1,PLAZA SANCHEZ ALBERT,47,8,68,54,94,271
46,QUINTERO CARDOZO DUVAN DARIO,79,8,29,15,32,163
13,QUINTERO CARDOZO NESTOR ALEJANDRO,98,15,90,3,60,266
24,RAMIREZ BARRETO DIEGO ANDRES,69,57,75,46,9,256
16,RINCON HERNANDEZ HEIDY TATIANA,32,50,4,56,46,188
18,RIOS RODRIGUEZ ANDRES FELIPE,83,46,21,29,52,231
9,RODRIGUEZ GONZALEZ NESTOR DAVID,5,27,12,12,54,110
53,RODRIGUEZ TIQUE NESTOR,95,8,65,81,89,338
33,RODRIGUEZ VANEGAS JANIER,83,39,4,52,97,275
42,RUBIANO FIERRO DIANA MARCELA,83,4,76,97,26,286
25,SALAZAR CANO JULY ALEXANDRA,5,33,50,7,74,169
8,SANCHEZ PERDOMO RODRIGO JOSE,47,92,68,26,54,287
55,SANDOVAL ORTIZ PAOLY EUGENIA,64,71,12,37,44,228
29,SANTANA CORREA DAVID CAMILO,41,75,10,6,54,186
11,SIERRA TRUJILLO JUAN CARLOS,96,14,64,51,55,280
0,SUAREZ ROLDAN MONICA YULIETH,27,49,98,8,79,261
26,TRUJILLO CUERVO LUIS GONZAGA,9,33,81,30,46,199
17,VILLALBA QUESADA SONIA,29,36,66,7,17,155

In [149]:
by_puntaje = archivo.sort_values('PUNTAJE', ascending=False).head()
by_puntaje

,ESTUDIANTE,MATEMATICA,LENGUAJE,CIENCIAS,CIUDADANAS,IDIOMAS,PUNTAJE
47,HERNANDEZ LUGO PABLO FRANCISCO,91,88,90,66,79,414
48,MENDEZ MEDINA EDGAR HERNANDO,80,36,57,100,96,369
44,MONTES MOSQUERA CAMILO ANDRES,86,60,63,66,87,362
37,FERNANDO CRISTIAN,89,93,71,11,77,341
53,RODRIGUEZ TIQUE NESTOR,95,8,65,81,89,338

In [150]:
by_estudiante = by_puntaje.set_index('ESTUDIANTE')
by_estudiante

,MATEMATICA,LENGUAJE,CIENCIAS,CIUDADANAS,IDIOMAS,PUNTAJE
ESTUDIANTE,,,,,,
HERNANDEZ LUGO PABLO FRANCISCO,91,88,90,66,79,414
MENDEZ MEDINA EDGAR HERNANDO,80,36,57,100,96,369
MONTES MOSQUERA CAMILO ANDRES,86,60,63,66,87,362
FERNANDO CRISTIAN,89,93,71,11,77,341
RODRIGUEZ TIQUE NESTOR,95,8,65,81,89,338

In [151]:
tabla_1 = by_puntaje[['ESTUDIANTE', 'PUNTAJE']]
tabla_1

                        ESTUDIANTE  PUNTAJE
47  HERNANDEZ LUGO PABLO FRANCISCO      414
48    MENDEZ MEDINA EDGAR HERNANDO      369
44   MONTES MOSQUERA CAMILO ANDRES      362
37               FERNANDO CRISTIAN      341
53          RODRIGUEZ TIQUE NESTOR      338

In [152]:
puestos = [1,2,3,4,5]
tabla_1 = by_puntaje.set_index(np.array(puestos))
tabla_1.index.name = 'PUESTO'
tabla_1

,ESTUDIANTE,MATEMATICA,LENGUAJE,CIENCIAS,CIUDADANAS,IDIOMAS,PUNTAJE
PUESTO,,,,,,,
1,HERNANDEZ LUGO PABLO FRANCISCO,91,88,90,66,79,414
2,MENDEZ MEDINA EDGAR HERNANDO,80,36,57,100,96,369
3,MONTES MOSQUERA CAMILO ANDRES,86,60,63,66,87,362
4,FERNANDO CRISTIAN,89,93,71,11,77,341
5,RODRIGUEZ TIQUE NESTOR,95,8,65,81,89,338

In [153]:
dimensiones = tabla_1.shape
dimensiones[1]

7

In [154]:
tabla_1['PUESTO'] = list(range(1, tabla_1.shape[0] + 1))
tabla_1

,ESTUDIANTE,MATEMATICA,LENGUAJE,CIENCIAS,CIUDADANAS,IDIOMAS,PUNTAJE,PUESTO
PUESTO,,,,,,,,
1,HERNANDEZ LUGO PABLO FRANCISCO,91,88,90,66,79,414,1
2,MENDEZ MEDINA EDGAR HERNANDO,80,36,57,100,96,369,2
3,MONTES MOSQUERA CAMILO ANDRES,86,60,63,66,87,362,3
4,FERNANDO CRISTIAN,89,93,71,11,77,341,4
5,RODRIGUEZ TIQUE NESTOR,95,8,65,81,89,338,5

In [155]:
tabla_1['Promedio']= tabla_1[['MATEMATICA','LENGUAJE','CIENCIAS','CIUDADANAS','IDIOMAS']].mean(axis=1)
tabla_1

,ESTUDIANTE,MATEMATICA,LENGUAJE,CIENCIAS,CIUDADANAS,IDIOMAS,PUNTAJE,PUESTO,Promedio
PUESTO,,,,,,,,,
1,HERNANDEZ LUGO PABLO FRANCISCO,91,88,90,66,79,414,1,82.8
2,MENDEZ MEDINA EDGAR HERNANDO,80,36,57,100,96,369,2,73.8
3,MONTES MOSQUERA CAMILO ANDRES,86,60,63,66,87,362,3,72.4
4,FERNANDO CRISTIAN,89,93,71,11,77,341,4,68.2
5,RODRIGUEZ TIQUE NESTOR,95,8,65,81,89,338,5,67.6

In [156]:
promedio = archivo.mean()
promedio.round(2)

MATEMATICA     55.33
LENGUAJE       46.07
CIENCIAS       51.75
CIUDADANAS     45.91
IDIOMAS        51.09
PUNTAJE       250.16
dtype: float64

In [157]:
type(promedio)

pandas.core.series.Series

In [158]:
tabla_2 = pd.DataFrame(promedio)
tabla_2

                     0
MATEMATICA   55.333333
LENGUAJE     46.070175
CIENCIAS     51.754386
CIUDADANAS   45.912281
IDIOMAS      51.087719
PUNTAJE     250.157895

In [159]:
tabla_2.columns = ['PROMEDIO']
tabla_2.index.name = 'PRUEBAS'
tabla_2

              PROMEDIO
PRUEBAS
MATEMATICA   55.333333
LENGUAJE     46.070175
CIENCIAS     51.754386
CIUDADANAS   45.912281
IDIOMAS      51.087719
PUNTAJE     250.157895

In [160]:
import os
os.mkdir('dir')

In [163]:
tabla_1.to_csv(r'./dir/promedios.csv')

In [164]:
a = 3
b = 5

8